プログラミングの基礎
1.数字に名前を付ける
2.もしも～と条件を分ける
3.繰り返す
4.一連の動作を関数にする

変数 :Pytyonでは変数を宣言する際に型を指定する必要はない。

データ型

int :整数
float :浮動小数点数
str :文字列
list :リスト
tuple :タプル
      一度作成すると変更できないリスト。
      タプルの中身が1つの場合は

      my_tuple=("only element",) #カンマをつける

dict :辞書 ハッシュテーブル キー:バリューで格納できる
set : 集合
      順序付けられていないユニーク(重複しない)な要素のコレクション

if文 :条件文
for文 :指定回数繰り返す
while文 :指定条件になるまで繰り返す
関数 :ある特定のタスクを遂行するためのまとまり。再利用可能でコードを整理し可読性を高めることができる。
クラス :Pythonはオブジェクト指向プログラミング言語でクラスを使って新しいデータ型を定義できる。クラスはメソッド(関数)と属性(データ)を持つことができる。      